[
    {
        "pmid": "39889253",
        "title": "Polygenic Susceptibility to Diabetes and Poor Glycemic Control in Stroke Survivors.",
        "abstract": "Type 2 diabetes mellitus (T2DM) is highly genetically determined, and polygenic susceptibility to T2DM (PSD) increases the risk of worse glycemic control and adverse vascular outcomes. Its role in stroke patients remains unknown. We aim to determine whether higher PSD is associated with worse glycemic control in stroke survivors. We conducted a 2-stage genetic association study. In a cross-sectional design, we selected stroke survivors from the UK Biobank (enrollment between 2006 and 2010) to evaluate the relationship between PSD and glycemic control. Second, we replicated the results using data from All of Us (enrollment between 2018 and 2022). Exposures were low, intermediate, and high PSD, modeled through percentiles (<20, 20-80, >80) of a polygenic risk score of 2,522 independent risk variants associated with T2DM at genome-wide levels ( < 5 × 10). Outcomes were hemoglobin A1c (HbA1c) levels, uncontrolled diabetes (HbA1c ≥7.0%), and resistant diabetes (uncontrolled despite antidiabetic treatment). Stage 1 included 6,908 stroke survivors (mean age 61 years, 42% female), including 977 (14%) with diabetes. Compared with low PSD, participants with high PSD had an increase of 0.49 in HbA1c (β = 0.49, standard error 0.03, -trend <0.001), 6.9 times the odds of uncontrolled diabetes (odds ratio [OR] 6.92, 95% CI 4.71-10.52), and 7.8 times the odds of resistant diabetes (OR 7.76, 95% CI 4.92-12.89). Stage 2 (replication) confirmed the association with HbA1c in 4,451 stroke survivors, including 2,163 (49%) with diabetes (mean age 64 years, 53% female, -trend <0.05 for all tests). Among stroke survivors, a higher PSD was associated with poorer glycemic control. Further research should determine precision medicine strategies using PSD to improve clinical management of stroke patients.",
        "authors": [
            "Zachariah S Demarais",
            "Carolyn Conlon",
            "Cyprien A Rivier",
            "Santiago Clocchiatti-Tuozzo",
            "Daniela Renedo",
            "Victor Torres-Lopez",
            "Kevin N Sheth",
            "Daniella Meeker",
            "Hongyu Zhao",
            "Lucila Ohno-Machado",
            "Julian N Acosta",
            "Shufan Huo",
            "Guido J Falcone"
        ],
        "journal": "Neurology",
        "publication_date": "2025",
        "doi": "10.1212/WNL.0000000000210276",
        "pubmed_link": "https://pubmed.ncbi.nlm.nih.gov/39889253/"
    },
    {
        "pmid": "39889198",
        "title": "Pharmacological treatment of pregnancy complications in adults: An overview of phase IV clinical trials.",
        "abstract": "The aim of this review was to provide a review of the pharmacological treatments for pregnancy complications in adults. This review analyzed medications used for pregnancy complications in phase IV clinical trials based on the ClinicalTrials.gov database. The search included completed trials only. As of September 1, 2023, a total of 29,654 phase IV clinical trials were identified, of which 298 were related to pregnancy complications. Of these, 24 clinical trials met the inclusion criteria for the current study. In the 24 included clinical trials, we found 9 trials for overactive bladder with 5005 participants in total, 236 of which had adverse effects from the drugs used. Six trials for preeclampsia were conducted on 663 participants, with only 1 adverse drug effect reported. Three trials each were conducted on urinary tract infections and gestational diabetes mellitus (115 and 656 participants, respectively) without any adverse drug effects reported. One trial each focused on anemia, dystocia, and placentation disorders (80, 1003, and 14 participants, respectively) without any adverse drug effects reported. The trials reported minimal adverse drug effects, suggesting potential effectiveness and safety in managing these complications. While the trials mentioned minimal adverse effects, close monitoring and individualized patient care are essential, as are evaluating the risk-benefit ratio and the specific circumstances of each patient.",
        "authors": [
            "Rawan F Allehyani",
            "Atheer A Alsehli",
            "Raghad Z Saggat",
            "Mohammed M Aldurdunji",
            "Nasser M Alorfi"
        ],
        "journal": "Medicine",
        "publication_date": "Unknown",
        "doi": "10.1097/MD.0000000000041322",
        "pubmed_link": "https://pubmed.ncbi.nlm.nih.gov/39889198/"
    },
    {
        "pmid": "39889189",
        "title": "Traditional Chinese medicine for premature ventricular contraction caused by obstructive sleep apnea: A case report and literature review.",
        "abstract": "Premature ventricular contraction (PVC) is a common type of arrhythmia, and obstructive sleep apnea (OSA) is a common trigger for this condition. Some patients still have PVC, even if ventilation is improved by wearing a respirator. Traditional Chinese medicine (TCM) has a long history of arrhythmia treatment, and this is the first report of a patient with PVC caused by OSA treated with TCM. Twenty-four-hour Holter showed that the number of PVCs decreased from 8968 to 0 before and after TCM treatment, and discomfort symptoms disappeared completely. A 37-year-old middle-aged man, with no history of hypertension, diabetes, hyperlipidemia, or other underlying diseases, had been suffering from OSA for over 1 year and currently uses a respirator to sleep. He was diagnosed with PVC at Beijing Anzhen Hospital 1 year ago and had been taking propafenone hydrochloride tablets following the physician's advice, but palpitation had not been relieved. The patient did not consider surgery and hoped to take TCM to treat the palpitations. The patient was diagnosed with PVC. After excluding other factors that could cause PVC, it was ultimately considered that the patient's PVC was related to OSA. The patient visited Xiyuan Hospital on December 5, 2023, on the basis of existing Western medicine and TCM, using the modified Huanglian Wendan Decoction. After taking TCM for 21 days, the Holter tests were conducted again. The results showed that the number of PVCs decreased from 8968 to 0 within 24 hours. Meanwhile, his palpitations were relieved, and the dosage of propafenone hydrochloride tablets was halved. After 7 days, he did not experience any discomfort; therefore, propafenone hydrochloride tablets were discontinued and TCM was exclusively administered. He received 7 additional courses in TCM. During the final consultation on April 23, 2024, the patient reported no discomfort, and snoring improved. After treatment with TCM, the patient's palpitations disappeared completely and snoring improved, which proved that TCM can treat PVC caused by OSA. To verify this conclusion, more high-quality research is necessary to establish the efficacy and underlying mechanisms of TCM in treating PVC caused by OSA.",
        "authors": [
            "Qing-Qing Yue",
            "Yi-Fang Hao",
            "Ting Li",
            "Han-Ying Miao",
            "Bing-Chang Chen",
            "Sheng-Yao Li"
        ],
        "journal": "Medicine",
        "publication_date": "Unknown",
        "doi": "10.1097/MD.0000000000041206",
        "pubmed_link": "https://pubmed.ncbi.nlm.nih.gov/39889189/"
    },
    {
        "pmid": "39888842",
        "title": "A herbal approach to diabetic cardiomyopathy: moringa, ginger, and garlic unveiled.",
        "abstract": "Chronic inflammation contributes to myocardial complications in diabetes, marked by tissue fibrosis, necrosis, and apoptosis.  and  have individually demonstrated efficacy in diabetes management. In this study, it is hypothesised that a combination of these herbs in a polyherbal formulation would protect against diabetic cardiomyopathy. Diabetes was induced in male Sprague Dawley rats using strepetozotocin at a single dose of (55 mg/kg of body weight,  in citrate buffer. Polyherbal formulation was administred as a treatment for 8 weeks. Rats receiving treatment with polyherbal formulation showed decreased blood glucose, plasma creatinine, Blood Urea Nitrogen, Creatine kinase- myocardial band, lactate dehydrogenase, aspartate aminotransferase, Troponin-I, NADPH oxidase 4, and Ras-related C3 botulinum toxin substrate-1. In contrast, Superoxide dismutase, catalase, and glutathione enzyme activities were increased. Thus, a polyherbal formulation containing herbs was able to attenuate the progression of diabetes mellitus and diabetic cardiomyopathy.",
        "authors": [
            "Kaushal Shah",
            "Manjiri Jalgaonkar",
            "Aditi Vyas",
            "Gaurav Doshi",
            "Yogesh A Kulkarni",
            "Alok D Singh",
            "Manisha J Oza"
        ],
        "journal": "Archives of physiology and biochemistry",
        "publication_date": "2025",
        "doi": "10.1080/13813455.2025.2459871",
        "pubmed_link": "https://pubmed.ncbi.nlm.nih.gov/39888842/"
    },
    {
        "pmid": "39888728",
        "title": "The Role of Serum Free Fatty Acids in Endothelium-Dependent Microvascular Function.",
        "abstract": "Elevated serum free fatty acid (FFA) concentration is associated with insulin resistance and is a hallmark of metabolic syndrome. A pathological feature of insulin resistance is impaired endothelial function. To investigate the effect of FFA reduction with either acipimox, a nicotinic acid derivative that impairs lipolysis, or salsalate, a salicylate that reduces basal and inflammation-induced lipolysis, on insulin-mediated endothelium-dependent vasodilation. This was a post hoc, combined analysis of two randomised, double-blind, placebo-controlled crossover trials. Sixteen subjects were recruited (6 with metabolic syndrome and 10 controls) and randomised to acipimox 250 mg orally every 6 h for 7 days or placebo. Nineteen subjects were recruited (13 with metabolic syndrome and 6 controls) and randomised to receive salsalate 4.5 g/day for 4 weeks or placebo. The primary outcome was the association between FFA concentration and insulin-mediated vasodilation, measured by venous-occlusion strain-gauge plethysmography at baseline and following FFA modulation with the study drugs. At baseline, FFA concentration (R = -0.35, p = 0.043) and insulin sensitivity (HOMA-IR: R = -0.42, p = 0.016, Adipo-IR: R = -0.39, p = 0.025) predicted insulin-mediated vasodilation. FFA levels were significantly reduced after drug pretreatment (0.604 vs. 0.491 mmol/L, p = 0.036) while insulin levels, insulin sensitivity and inflammatory markers were unchanged. Despite a reduction in circulating FFA with drug therapy, neither insulin-stimulated vasodilation nor insulin sensitivity improved. Short-term reduction of FFA concentration does not improve insulin-stimulated vasodilation in patients with metabolic syndrome. ClinicalTrials.gov identifier: NCT00759291 and NCT00760019 (formerly NCT00762827).",
        "authors": [
            "Alexander E Sullivan",
            "Meaghan C S Courvan",
            "Aaron W Ada",
            "David H Wasserman",
            "Kevin D Niswender",
            "Emily M Shardelow",
            "Emily K Wells",
            "Quinn S Wells",
            "Matthew S Freiberg",
            "Joshua A Beckman"
        ],
        "journal": "Endocrinology, diabetes & metabolism",
        "publication_date": "Unknown",
        "doi": "10.1002/edm2.70031",
        "pubmed_link": "https://pubmed.ncbi.nlm.nih.gov/39888728/"
    }
]