[
{"url": "https://diabetes.org/about-diabetes/diabetes-myths", "title": "Know Your Facts About Diabetes", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. Diabetes can be confusing, but we are committed to helping you understand the facts about diabetes. The following questions will help clear up diabetes myths you may have heard. Being overweight is a risk factor for developing diabetes, but other risk factors such as how much physical activity you get, family history, ethnicity, and age also play a role. Unfortunately, many people think that weight is the only risk factor for type 2 diabetes, but many people with type 2 diabetes are at a normal weight or only moderately overweight. Research has also shown that drinking sugary drinks is linked to type 2 diabetes. The American Diabetes Association recommends that people avoid drinking sugar-sweetened beverages and switch to water whenever possible to help prevent type 2 diabetes. Sugary drinks also raise blood glucose (blood sugar) and can provide several hundred calories in just one serving. Just one 12-ounce can of regular soda has about 150 calories and 40 grams of sugar, a type of carbohydrate (carb). This is the same as 10 teaspoons of sugar. Sugar-sweetened beverages include beverages like: Yes. Diabetes causes more deaths per year than breast cancer and AIDS combined and having diabetes nearly doubles your chance of having a heart attack. The good news is that managing your diabetes can reduce your risk for diabetes complications. No, you don’t need special food. A healthy meal plan for people with diabetes is generally the same as healthy eating for anyone. In fact, there are a lot of different eating plans that can help you manage your diabetes. In general, a healthy eating plan for diabetes will include lots of non-starchy vegetables, limit added sugars, swap refined grains for whole grains and prioritize whole foods over highly processed foods when possible. Want to add more veggies and whole foods, but don’t know where to start? ! Starchy foods can be part of a healthy meal plan, but portion size is key. These foods tend to have more carbs and eating them will raise your blood glucose. There is no evidence to suggest that people with diabetes need to avoid carbs, though some people choose eating plans that avoid them. In fact, the evidence suggests that including the right amounts of carbs, protein, and fat can help manage your blood glucose. Working with your health care team can help you find the right balance for you. Aim for a portion no bigger than a quarter of a 9-inch plate. If eaten as part of a healthy meal plan sweets and desserts can be eaten by people with diabetes. The key to sweets is to have a very small portion and save them for special occasions so you focus your meals on healthier foods. Working with a registered dietitian nutritionist (RDN) or diabetes care and education specialist (CDCES) will help you determine an individualized meal plan that takes into account your goals as well as your likes and dislikes. No. Although we don't know exactly why some people develop diabetes and others don’t, we know diabetes is not contagious. It can't be caught like a cold or flu. You are no more likely to get a cold or another illness if you have diabetes. People with diabetes are advised to get flu shots. This is because any illness can make diabetes more difficult to control, and people with diabetes who get the flu are more likely than others to go on to develop serious complications. Using insulin to get blood glucose levels to a healthy level is a good thing, not a bad one. Type 2 diabetes is a progressive disease. When first diagnosed, many people with type 2 diabetes can keep their blood glucose at a healthy level with a combination of meal planning, physical activity, and taking oral medications. But over time, the body gradually produces less and less of its own insulin, and eventually, oral medications may not be enough to keep blood glucose levels in a healthy range. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "Regular soda", "Fruit punch", "Fruit drinks", "Energy drinks", "Sports drinks", "Sweet tea", "Sweetened coffee drinks", "Other sugary drinks", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/a1c", "title": "What Is the A1C Test?", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "How Does the A1C Test Work?", "Interpreting Your A1C Results", "’", "We’re here to help.", "Checking Your Blood Glucose", "Medication Management", "Device Technology", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. The A1C test can be used to diagnose diabetes or help you know how your treatment plan is working by giving you a picture of your average blood glucose (blood sugar) over the past two to three months. It can identify , which raises your risk for diabetes. It can be used to . And it's used to monitor how well your diabetes treatment is working over time. It's also a critical step in forming your game plan to manage diabetes with your diabetes care team. This can tell you a lot. The test results give you a picture of your average blood glucose (blood sugar) level over the past two to three months. The higher the levels, the greater your risk of developing diabetes complications. Your doctor will tell you how often you need the A1C test, but usually you’ll have the test at least twice a year if you’re meeting your treatment goals. If you're not meeting your goals or you change treatments, you may need to get an A1C test more often. When it comes to the numbers, there's no one-size-fits-all target. A1C target levels can vary by each person's age and other factors, and your target may be different from someone else's. The goal for most adults with diabetes is an A1C that is less than 7%. A1C test results are reported as a percentage. The higher the percentage, the higher your blood glucose levels over the past two to three months. The A1C test can also be used for diagnosis, based on the following guidelines:   Another term you may come across when finding out your A1C is eAG. Your doctor might report your A1C results as eAG. eAG is similar to what you see when monitoring your blood glucose at home on your meter. However, because you are more likely to check your blood glucose in the morning and before meals, your meter readings will likely be lower than your eAG.  Comparison of A1C and eAG meter readings   Checking your blood glucose level at any one time. Get a handle on diabetes medication. Better blood glucose meters and more. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "If your A1C level is between 5.7 and less than 6.5%, your levels have been in the prediabetes range.", "If you have an A1C level of 6.5% or higher, your levels were in the diabetes range.", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/vaccinations", "title": "Vaccinations", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "Flu Shots", "Should you get a flu shot?", "What to do if you have diabetes and symptoms of flu", "Pneumococcal diseases & pneumonia shots", "Respiratory Syncytial Virus", "Other recommended vaccines", "Paying for vaccines", "Downloadable resources", "Other resources", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. Explore how staying up-to-date on vaccinations can offer substantial benefits for people living with diabetes and provide an important shield against illness. Having the flu can be dangerous for anyone. But it is extra risky for people with diabetes or other chronic health problems. Having diabetes means having more instances of high blood glucose (blood sugar) than a person without diabetes. High blood glucose hinders your white blood cells’ ability to fight infections. Beyond people living with diabetes, flu is also extra risky for people with heart disease, smokers and those with chronic lung disease, people who have an impaired immune system (like those going through chemotherapy, or who are organ donation recipients), very young children, and people living in very close quarters, such as college dorms, military barracks, or nursing homes. Talk with your doctor about having a flu shot. Flu shots do not give 100% protection, but they do make it less likely for you to catch the flu for about six months. For extra safety, it's a good idea for the people you live with or spend a lot of time with to get a flu shot, too. You are less likely to get the flu if the people around you don't have it. The best time to get your flu shot is beginning in September. The shot takes about two weeks to take effect. If you’re sick (such as having a cold or fever), ask if you should wait until you are healthy again before having your flu shot. And don't get a flu shot if you are allergic to eggs. You are advised to continue to take the general precautions of preventing seasonal flu and other communicable illnesses and diseases: Many illnesses and diseases spread through contact with body fluids. This contact is commonly through being coughed on. Other close contact with an infected person, such as hugging or kissing them, can lead to the spread as well. Talk with your doctor now about how to reach him or her if you think you have the flu. Symptoms of influenza can include: People may be infected with the flu and have respiratory symptoms without a fever. There is a category of diseases called pneumococcal disease, of which pneumonia is one of the most dangerous—the other most dangerous being meningitis. People with diabetes are about three times more likely to die with flu and pneumococcal diseases, yet most don’t get a simple, safe pneumonia shot. Symptoms of pneumonia include: •    Cough that can produce mucus that is gray, yellow, or streaked with blood •    Chest pain •    Rapid or difficult breathing •    Fever •    Chills Symptoms of meningitis include: •    Fever and chills •    A stiff, immovable neck that gets progressively worse •    Severe headache •    Confusion •    Photophobia (eye sensitivity to light) •    Lethargy to the point of being unresponsive A pneumonia shot is a safe and effective way to protect you against getting these illnesses, so the most important step you can take in preventing pneumococcal infection is to get vaccinated. Talk to your doctor about a plan to get vaccinated. Factors for which vaccine is right for you include your age and if you've already received one. Typically, you’ll get one vaccine, wait a year, and then get the second immunization. Respiratory syncytial virus (RSV) can cause serious problems for people living with diabetes, especially older adults. RSV is a common infection that can lead to severe complications, including pneumonia and bronchiolitis. Symptoms of RSV can include: If you have diabetes, you are more likely to get RSV and its complications because your immune system might be weakened and less effective. That’s why it’s important to protect yourself against RSV. And, being vaccinated also helps prevent you from spreading the virus to others around you. The Centers for Disease Control and Prevention (CDC) recommends getting vaccinated in the late summer or early fall. Both the pneumonia and meningitis vaccines are covered by Medicare Part B if the vaccines are given one year apart. Learn more at . Most private insurance programs cover pneumococcal vaccines at low or no cost. The Vaccines for Children program covers the vaccine for those 19 and younger if they’re Medicaid-eligible, uninsured or underinsured, or American Indian or Alaska Native. Learn more at . Gain a comprehensive overview of the recommended vaccines in this infographic, detailing a vaccination schedule based on age. Seasonal respiratory illness not only affects the people that have it, but also those around them. Learn how to shield yourself and your loved ones with this resource. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "Cover your nose and mouth with a tissue when you cough or sneeze. Throw the tissue in the trash. If you don’t have a tissue, cough or sneeze into your elbow, not your hand.", "Wash your hands often with soap and water, especially after you cough or sneeze. Alcohol-based hand cleaners are also effective.", "Avoid touching your eyes, nose, or mouth. Germs spread that way.", "Try to avoid close contact with sick people.", "If you get sick, stay home from work or school and limit contact with others to keep from infecting them.", "Fever", "Cough", "Sore throat", "Runny or stuffy nose", "Body aches", "Headache", "Chills", "Fatigue", "Some people may also have vomiting and diarrhea", "Runny nose", "Decrease in appetite", "Coughing", "Sneezing", "Fever", "Wheezing", "Tdap vaccine (tetanus, diphtheria, and pertussis)", "Hepatitis B vaccine (in three parts)", "Zoster vaccine (shingles)", "ADA Center for Information: Call 1-800-DIABETES (800-342-2383), 9:00 a.m. to 5:30 p.m. ET, Monday–Friday, or email askada@diabetes.org.", "", ": One-stop access to U.S. Government swine, avian and pandemic flu information", "", ": The American Lung Association collaborated primarily with the Centers for Disease Control and Prevention (CDC), the Influenza Summit, and the Immunization Action Coalition to compile a comprehensive database of clinics offering flu shots. All you need to do to find a clinic near you is enter your zip code.", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/diabetes-prevention/dpp", "title": "Prevent or Delay Diabetes", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "See if you qualify and find a program near you", "What is the National DPP?", "Watch to Learn More", "The ADA and CDC Diabetes Prevention Program Cooperative Agreement", "Do you know your risk for type 2 diabetes?", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. The National Diabetes Prevention Program (National DPP) is based on a curriculum shown to prevent or delay the onset of type 2 diabetes in adults that are at high risk. To start your journey of making simple lifestyle changes that can improve your health and prevent or delay type 2 diabetes, discover if a National DPP lifestyle change program is a good option for you and learn if you qualify. The National DPP is a partnership of organizations that support the delivery of an evidence-based lifestyle change program that has been in those with prediabetes. The six-month core program, followed by a six-month maintenance period, offers personalized support from lifestyle coaches and weekly group meetings during your journey to better health. The program covers: The program provides a flexible learning format with in-person, virtual, and distance learning options. These videos will help you learn how healthy living helps to prevent or delay diabetes. The Centers for Disease Control and Prevention (CDC) awarded the American Diabetes Association (ADA) a five-year cooperative agreement to develop a multi-sectoral network that supports national efforts to prevent or delay type 2 diabetes in American adults with prediabetes. The cooperative agreement focuses on: The CDC is investing in the ADA and three other recipients across the United States to solve many of the challenges that have limited National DPP adoption and ultimately bend the curve on the number of people developing type 2 diabetes. Learning your risk is the in taking action against type 2 diabetes. Find out if you’re at risk and receive actionable next steps in your health journey. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "Discover the benefits of an eating plan to help you reach or maintain weight wellness.", "Learn how regular physical activity can boost your energy, improve your mood, and help you stay on track with your health goals.", "Gain effective problem-solving techniques to overcome common challenges when being active, following a meal plan, or losing weight.", "Learn how to identify and address the stress in your life that may derail your journey to better health.", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/type-1", "title": "Understanding Type 1 Diabetes", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "What is type 1 diabetes?", "Type 1 Diabetes Symptoms", "Calling All Professionals", "The Honeymoon Phase", "Is it Possible You Don't Have Type 2 Diabetes?", "Type One Diabetes", "Type One Diabetes", "Resources for Type 1 Diabetes", "Resources for Living with Type 1 Diabetes", "Nutrition", "Physical Activity", "Diabetes Food Hub®", "Safe at School®", "Healthy Living e-newsletter", "Mental Health Resource", "Diagnosis and Classification of Type 1 Diabetes", "Prevention or Delay of Diabetes", "Infographics", "Latest Innovations and Treatments in Type 1 Diabetes", "School Nurse Resources", "Information specialists at the Center for Information are your personal guides to information on diabetes, donation inquiries, as well as American Diabetes Association programs and events.", "1-800-DIABETES ( 1-800-342-2383 )", "", "Supported in part by:", "Sanofi", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. Type 1 diabetes is an autoimmune disease. Testing, coupled with education about diabetes symptoms and close follow-up, has been shown to enable earlier diagnosis and to prevent diabetes ketoacidosis. When you have type 1 diabetes, your immune system mistakenly treats the beta cells in your pancreas that create insulin as foreign invaders and destroys them. When enough beta cells are destroyed, your pancreas can’t make insulin or makes so little of it that you need to take insulin to live. Insulin is a hormone that helps blood glucose (blood sugar) enter your body’s cells so that it can be used as energy. If you have diabetes, blood glucose can’t enter your cells so it builds up in your bloodstream. This causes high blood glucose ( ). Over time, high blood glucose harms your body and can lead to if not treated. Most of the time, type 1 diabetes is diagnosed in young people, but it can develop in anyone at any age. Scientists and researchers today aren’t sure how to prevent type 1 diabetes or what triggers it. If you have type 1 diabetes, you can live a long, healthy life by having a strong support system and managing it with your . The treatment plan you develop with your diabetes care team will include insulin, physical activity, and an eating plan to reach your health goals. If you or your child have the following symptoms of diabetes, let your health care provider know. Symptoms include: It’s important to know when you first develop type 1 diabetes, you may not have any symptoms at all. Children with Type 1 Diabetes Adults with Type 1 Diabetes Learning Your Risk for Type 1 Diabetes Why Learning Your Risk Helps Children with type 1 diabetes will usually have the symptoms listed above. If your child is potty-trained without issues at night starts having accidents and wetting the bed again, diabetes might be the reason. Even though it’s easy to diagnose a child with diabetes by checking their blood glucose at the doctor’s office or emergency room, the tricky part is recognizing the symptoms and knowing to take your child to get checked. If you’re a parent, it’s important to know that young children, including infants, can develop type 1 diabetes. Sometimes children can be in when they are diagnosed with diabetes. When there is a lack of insulin in the body, high levels of an acid called ketones can build up. DKA is a medical emergency that usually requires hospitalization and immediate care with insulin and IV fluids. When an adult develops type 1 diabetes, they are often mistakenly told they have type 2 diabetes. This may be from lack of awareness that type 1 diabetes can start at any age and in people of every race, shape, weight, and size. People with type 1 diabetes who also have the classic risk factors for type 2 diabetes—such as overweight/obesity, not being physically active, having high blood pressure, or are over age 35—are often misdiagnosed. It can also be tricky because some adults with new-onset type 1 diabetes are not sick at first. Their health care provider may find an elevated blood glucose level at a routine visit and starts them on diet, exercise, and an oral medication. Early detection and treatment of diabetes can decrease the risk of developing complications both at the time of diagnosis and in the future. By knowing and recognizing the symptoms above, you can learn if you have type 1 diabetes early and avoid complications, like . Did you know? If you have a family history of type 1 diabetes, your health care provider may suggest screening for type 1 diabetes. They will order a blood test to measure your islet autoantibodies. The test results can go one of two ways: Even if you may not want to know if you, your children, or other family members are at risk for developing type 1 diabetes, there are benefits to knowing. First, you can learn more about the early warning signs of type 1 diabetes so you and your health care team can detect diabetes early—before DKA or severe illness develops. Because DKA can be life-threatening and early symptoms can be vague, knowing what to watch out for can help detect and treat DKA early or prevent it altogether. Second, there are emerging treatments and clinical trials that seek to delay the onset of type 1 diabetes in those who are at high risk. If you are at high risk for developing type 1 diabetes, it will be important to speak with an endocrinologist to learn whether these opportunities may be available and right for you. ADA convened leading experts, including endocrinologists, researchers, primary care professionals, certified diabetes care and education specialists, and mental health professionals, to understand opportunities and barriers to type 1 diabetes screening and awareness. The outcome of this roundtable is a report that outlines the discussion and potential opportunities for future direction. Some people with type 1 diabetes have a \"honeymoon\" period, a brief period of time where your body is producing enough insulin to lower blood glucose levels. The honeymoon phase usually happens after you start taking insulin and you may not need as much to manage your blood glucose. Work with your diabetes care team for to avoid complications like . A honeymoon period can last as little as a week or even up to a year. It’s important to know that the absence of symptoms doesn't mean the diabetes is gone. The pancreas will eventually be unable to make enough insulin, and, if untreated, the symptoms will return. If you or someone you know is diagnosed with but isn’t able to manage it with the typical treatments for type 2 diabetes, it may be worth a visit to an endocrinologist to verify what type of diabetes you have. Generally, this requires antibody tests and possibly the measurement of a C-peptide level. It is important to be sure that your diagnosis is correct because that will determine your treatment plan, allowing you manage your diabetes and prevent its complications. Browse these resources for type 1 diabetes. Whether you’ve lived with diabetes for a long time, are newly diagnosed, or a caregiver, we have the resources to help you learn about how to navigate life with type 1. Having diabetes doesn’t mean giving up all your favorite foods, it’s about modifying what you love to fit your new lifestyle and help you manage diabetes. Staying physically active will help you manage your diabetes, improve your mood, and lower your risk for complications. Access thousands of free diabetes-friendly recipes for all meals, occasions, and dietary restrictions—plus nutrition articles that answer common questions people have about eating with diabetes. This program helps to ensure children with diabetes receive the care they need at school. Sign up to receive diabetes-friendly recipes, articles, and more resources delivered directly to your email inbox every month. Screening for diabetes has a significant emotional and mental health toll. These resources can help you offer support to people you treat and their families. Read our recommendations on type 1 diabetes screening and diagnosis. Read recommendations on interventions to delay type 1 diabetes.  These documents provide at-a-glance guidance for type 1 diabetes screening based on the .  Earn free CE credit in the Institute of Learning. School nurses play an important role for students with type 1 diabetes and their caregivers. Training resources are available. Sanofi supports phase 3 of ADA’s Therapeutic Inertia program. The main goal of phase 3 is to promote the measurable adoption of evidence-based practices, strategies, programs and tools that address key barriers associated with therapeutic inertia in diabetes care, leading to improved, timely treatment modification and improved overall glycemic control in adult patients with type 2 diabetes. Sanofi also supported the American Diabetes Association’s 100 Years of Insulin, a year-long campaign that focused on awareness, education and promoting activities that build community. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "Urinating often", "Feeling very thirsty", "Feeling very hungry—even though you are eating", "Extreme fatigue", "Blurry vision", "Cuts/bruises that are slow to heal", "Weight loss—even though you are eating more", "", "", "", "", "", "", "", "", "", "", "", "", "Type 1 diabetes doesn’t develop only in children", "There have been recent advances in type 1 diabetes screening and treatment", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/prediabetes", "title": "With prediabetes, action is the best medicine.", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "You have the power to change things.", "What it Means and What You Can Do", "Lifestyle Change Programs", "Build a Healthier Future", "We’re here to help.", "Project Power", "Prevention", "Know Your Risk", "Genetics of Diabetes", "Type 2", "Myths About Diabetes", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. If you’ve been diagnosed with prediabetes, we know that can feel like a lot—like your life has changed and you’ll never be “normal” again. But know that that isn’t the case. For some people with prediabetes, early treatment as well as moderate lifestyle changes can actually return blood glucose (blood sugar) levels to a normal range, effectively . Ask your doctor plenty of questions and listen to their answers. Increase your daily physical activity. Start eating healthy. And your life can be yours again. There are no clear symptoms of prediabetes so you may have it and not know it. But before people develop type 2 diabetes, they almost always have prediabetes—where blood glucose levels are higher than normal but not yet high enough to be diagnosed as diabetes. It is possible that you may have some of the symptoms of diabetes or even some of the complications. If you think you may have diabetes or prediabetes, check with your doctor and get tested. If you discover that you do have prediabetes, remember that it doesn’t mean you’ll develop type 2, particularly if you follow a treatment plan and make changes to your lifestyle through food choices and physical activity. Even small changes can have a huge impact on delaying or preventing diabetes all together. Work with a health care professional to make a plan that works for your lifestyle, or look for a Centers for Disease Control and Prevention (CDC)-recognized lifestyle change program, guided by a lifestyle coach trained to use a CDC-approved curriculum, where you will meet other people who are working to prevent diabetes. A CDC-recognized lifestyle change program could cut your risk of developing type 2 diabetes in half. With prediabetes, there are simple steps you can take to change things, such as adapting your food choices and increasing your daily physical activity to lose weight, if needed. Project Power is here to help the whole family. Take steps to prevent or delay the onset of type 2 diabetes. If you're at risk of developing type 2 diabetes, there's no better time to turn things around. Learn about the role genetics plays in diabetes. Your type 2 journey is unique and it starts fresh every day. Get answers to common questions concerning diabetes myths. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/statistics", "title": "Examine the Facts", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "It’s a nationwide epidemic", "The cost of diabetes", "Statistics by state", "Diabetes Overview", "Diabetes Blog", "Advocacy", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. Over 38 million children and adults have diabetes in the United States. The numbers associated with diabetes make a strong case for devoting more resources to finding a cure. The national cost of diabetes in the U.S. in 2022 was more than $412.9 billion, up from $327 billion in 2017. Diabetes is growing at an epidemic rate in the United States. And what's true nationwide is also true in each state. The path to understanding diabetes starts here. Stay informed. Stay empowered. We are transforming lives with action. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/complications", "title": "Diabetes Complications", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "Let’s Get Serious About Diabetes", "Diabetes Complications Explained", "Cardiovascular Disease", "Chronic Kidney Disease", "Diabetes-Related Eye Disease", "Neuropathy", "Foot Complications", "Skin Complications", "Oral Complications", "Hearing Loss", "Diabetic Ketoacidosis", "Stroke", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. What you need to know about diabetes complications. Diabetes can lead to severe, and in some cases, life-threatening complications. But you can lower your risk of diabetes-related complications like heart, kidney, and eye disease, as well as nerve damage by making healthy lifestyle changes, knowing the warning signs, and attending regular visits with your health care provider. Expand each of the complications below to learn more about them. Diabetes increases your risk for many serious health problems. The good news? With the correct treatment and recommended lifestyle changes, many people with diabetes are able to prevent or delay the onset of complications. Cardiovascular disease (CVD) is the leading cause of death in people living with diabetes. But, with a healthy lifestyle that includes exercise and an eating plan, you can reduce your CVD risk and other complications. Diabetes is the leading cause of chronic kidney disease (CKD). Factors including, genetics, blood glucose (blood sugar) management, and blood pressure affect your risk of developing CKD. Explore ways to prevent the onset of CKD or slow its progression. Diabetes is the leading cause of new cases of blindness in working age adults. Learn how routine comprehensive eye exams can provide early detection and prevent or delay vision loss and other valuable information to help avoid diabetes-related eye disease. Neuropathy (or nerve damage) affects about half of all people with diabetes. But keeping your blood glucose (blood sugar) levels on target is your best line of defense to keep it at bay. Learn about the different neuropathy types so you’ll know what symptoms to look for and what to discuss with your health care provider to prevent, delay, or manage this condition. Diabetes can lead to nerve damage, reduced circulation, and even limb loss. You can lower your risk for serious foot complications by taking care of your feet, managing your diabetes, and talking to your doctor if you notice problems with your feet. Diabetes can impact the body’s largest organ—your skin. But if caught early, most skin conditions can be prevented or easily treated. Learn ways to take care of your skin and about the different types of diabetes-related skin conditions so you know what to discuss with your health care team. If you have diabetes, you’re at higher risk for both gingivitis (early-stage gum disease) and periodontitis (advanced gum disease). You can prevent or reduce your risk for gum disease and other oral complications by taking care of your oral health at home and by getting routine checkups with a dentist or periodontist. Hearing loss is twice as common in people with diabetes as it is in those who don't have diabetes. For people with prediabetes, the rate of hearing loss is 30 percent higher than in those with normal blood glucose (blood sugar). Learn the signs and what action you should take if you suspect hearing loss. Diabetic ketoacidosis (DKA) is a life-threatening condition caused by an overload of ketones—a chemical that develops when your body breaks down fat to use for energy. Learn how you can prevent DKA by knowing the warning signs. If you have diabetes, your chances of having a stroke are twice as high than in people without diabetes. But you can lower your risk of having a stroke with healthy lifestyle changes and by managing your blood pressure, blood glucose (blood sugar), and cholesterol. Learn more about stroke risk and prevention, including warning signs and treatments. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes", "title": "The Path to Understanding Diabetes Starts Here", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "Help Is Here", "Warning Signs", "Understanding Diabetes", "Additional Resources", "Diabetes Complications", "More About Diabetes", "Devices & Technology", "Vaccinations", "Common Terms", "Diabetes Statistics", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. No matter where you are in your journey, here's where you need to be. Whether you're newly diagnosed, have had type 1 or type 2 diabetes for a while, or you're helping a loved one, you’ve come to the right place. This is the way to start learning how you can live a healthier life—with the tools, health tips, and food ideas you need. Wherever you are with diabetes, you can still live your best life—and we have the steps you can take to get there. All you have to do is take action and stick with it. Learn to recognize the warning signs of diabetes and how to find out if you have it. From symptoms and treatment, to management and medication—arm yourself with the knowledge to live well with diabetes. Diabetes can affect almost every part of your body, including your brain, heart, skin, kidneys, nerves, and ears. Learn how to prevent, delay, or treat these complications through healthy lifestyle changes. Get to know the facts vs. myths about living with diabetes. Plus, find out how genetics play a factor in developing diabetes. Diabetes devices and technology can be lifesaving—but which is right for you? Discover the benefits and drawbacks of continuous glucose monitors, blood glucose meters, insulin pumps, and more to find out what's available to help with your diabetes management needs. People with diabetes are more likely to get sick from illnesses like the flu. Stay on top of the vaccines recommended for people with diabetes to help you stay healthy. Do you ever get lost when talking to your health care team because you don't know what some of their words mean? To help you get the most out of your visits, here's a list of commonly used terms that are used when talking about diabetes. Get to know diabetes by the numbers, including stats on prevalence, complications, gender, race, and more. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/common-terms", "title": "Common Terms", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. Below is a list of diabetes-related terms and their definitions. Adapted from the National Institute of Diabetes and Digestive and Kidney Diseases (NIDDK).  A test that measures a person's average blood glucose (blood sugar) level over the past two to three months. Hemoglobin (HEE-mo-glo-bin) is the part of a red blood cell that carries oxygen to the cells and sometimes joins with the glucose in the bloodstream. Also called hemoglobin A1C or glycosylated (gly-KOH-sih-lay-ted) hemoglobin, the test shows the amount of glucose that sticks to the red blood cell, which is proportional to the amount of glucose in the blood. (uh-kan-THO-sis NIH-grih-kans) A skin condition characterized by darkened skin patches; common in people whose body is not responding correctly to the insulin that they make in their pancreas (insulin resistance). This skin condition is also seen in people who have prediabetes or type 2 diabetes.  Describes something that happens suddenly and for a short time. Opposite of chronic. (ad-HEE-sive cap-soo-LITE-is) (also commonly known as “frozen shoulder”) A condition of the shoulder associated with diabetes that results in pain and loss of the ability to move the shoulder.  Former term for type 2 diabetes. (A-G-EEZ) Stands for advanced glycosylation (gly-KOH-sih-LAY-shun) end products. AGEs are produced in the body when glucose links with protein. They play a role in damaging blood vessels, which can lead to diabetes complications. (al-BYOO-mih-NOO-ree-uh) A condition in which the urine has more than normal amounts of a protein called albumin. Albuminuria may be a sign of nephropathy (kidney disease). (AL-fa) A type of cell in the pancreas. Alpha cells make and release a hormone called glucagon. The body sends a signal to the alpha cells to make glucagon when blood glucose (blood sugar) falls too low. Then glucagon reaches the liver where it tells it to release glucose into the blood for energy. (AM-ih-lin) A hormone formed by beta cells in the pancreas. Amylin regulates the timing of glucose release into the bloodstream after eating by slowing the emptying of the stomach. (a-my-AH-truh-fee) A type of neuropathy resulting in pain, weakness and/or wasting in the muscles. (uh-NEE-mee-uh) A condition in which the number of red blood cells is less than normal, resulting in less oxygen being carried to the body's cells. (an-gee-AH-puh-thee) Any disease of the blood vessels (veins, arteries, capillaries) or lymphatic vessels. s (AN-ti-bod-eez) Proteins made by the body to protect itself from \"foreign\" substances such as bacteria or viruses. People develop type 1 diabetes when their bodies make antibodies that destroy the body's own insulin-making beta cells.  An oral medicine that lowers blood pressure; ARB stands for angiotensin (an-gee-oh-TEN-sin) receptor blocker. (ar-TEER-ee-oh-skluh-RO-sis) Hardening of the arteries. A large blood vessel that carries blood with oxygen from the heart to all parts of the body. (ATH-uh-row-skluh-RO-sis) Clogging, narrowing, and hardening of the body's large arteries and medium-sized blood vessels. Atherosclerosis can lead to stroke, heart attack, eye problems, and kidney problems. (AW-toh-ih-MYOON) Disorder of the body's immune system in which the immune system mistakenly attacks and destroys body tissue that it believes to be foreign. (aw-toh-NOM-ik ne-ROP-uh-thee) A type of neuropathy affecting the lungs, heart, stomach, intestines, bladder, or genitals. (REH-tih-NOP-uh-thee) An alternate name for non-proliferative (non-pro-LIF-er-uh-tiv) retinopathy.  A steady trickle of low levels of longer-acting insulin, such as that used in insulin pumps.  A cell that makes insulin. Beta cells are located in the islets of the pancreas. (also called blood sugar) The main source of energy that food is turned into that’s found in the blood. (blood sugar)  The amount of blood glucose at a specific time. It is measured in milligrams per deciliter, or mg/dL.  A small, portable machine used by people with diabetes to check their blood glucose levels. After pricking the skin with a lancet, one places a drop of blood on a test strip in the machine. The blood glucose meter (sometimes called a monitor) measures and displays the blood glucose level.  Checking blood glucose level on a regular basis in order to manage diabetes. A blood glucose meter or continuous glucose monitor (CGM) is needed for blood glucose monitoring.  The force of blood exerted on the inside walls of blood vessels. Blood pressure is expressed as a ratio (example: 120/80, read as \"120 over 80\"). The first number is the systolic (sis-TAH-lik) pressure, or the pressure when the heart pushes blood out into the arteries. The second number is the diastolic (DY-uh-STAH-lik) pressure, or the pressure when the heart rests.  Tubes that carry blood to and from all parts of the body. The three main types of blood vessels are arteries, veins, and capillaries. (BMI) A measure used to evaluate body weight relative to a person's height. BMI is used to find out if a person is underweight, normal weight, overweight, or obese. (BOH-lus) An extra amount of insulin taken to cover an expected rise in blood glucose (blood sugar), often related to a meal or snack.  Not a term recognized by the American Diabetes Association, borderline diabetes is sometimes used to describe prediabetes.  A term not recognized by the American Diabetes Association, sometimes used to describe when a person's blood glucose (blood sugar) levels move in extremes from low to high and from high to low. (see-peptide) \"Connecting peptide\", a substance the pancreas releases into the bloodstream in equal amounts to insulin. A test of C-peptide levels shows how much insulin the body is making. (KAP-ih-lair-ee) The smallest of the body's blood vessels. Oxygen and glucose pass through capillary walls and enter the cells. Waste products such as carbon dioxide pass back from the cells into the blood through capillaries. (kar-boh-HY-drate) One of the three main nutrients in food. Foods that provide carbohydrates are starches, vegetables, fruits, dairy products, and sugars.  A method of meal planning for people with diabetes based on counting the number of grams of carbohydrate in food. (kar-dee-AH-luh-jist) A doctor who treats people who have heart problems, which are more common in people with diabetes. (CAR-dee-oh MET-ah-BALL-ick) A set of conditions that have a big effect on whether or not you develop diabetes and/or heart disease. (KAR-dee-oh-VASK-yoo-ler) Disease of the heart and blood vessels (arteries, veins, and capillaries). (KA-ter-act) Clouding of the lens in front of the eye. (seh-REE-broh-VASK-yoo-ler) Damage to blood vessels in the brain. Vessels can burst and bleed or become clogged with fatty deposits. When blood flow is interrupted, resulting in a stroke. Brain cells die or are damaged. (CDCES) A health care professional with expertise in diabetes education who has met eligibility requirements and successfully completed a certification exam. (shar-KOHZ) A condition in which the joints and soft tissue in the foot are destroyed. (koh-LES-ter-all) A type of fat produced by the liver and found in the blood. It is also found in some foods. Cholesterol is used by the body to make hormones and build cell walls. When you have problems with your cholesterol, it can affect the blood flow through your blood vessels.  Describes something that is long-lasting. Opposite of acute.  The flow of blood through the body's heart and blood vessels.  A sleep-like state in which a person is not conscious. May be caused by hyperglycemia (high blood glucose) or hypoglycemia (low blood glucose) in people with diabetes.  A pill that includes two or more different medicines. The use of more than one medication (this can be oral and injected medications typically used to treat type 2 diabetes and insulin) to manage blood glucose (blood sugar) levels. Harmful effects of diabetes such as damage to the eyes, heart, blood vessels, nerves system, teeth and gums, feet, skin, or kidneys. Studies show that managing blood glucose (blood sugar), blood pressure, and cholesterol can help prevent or delay these problems.  A weakening of the heart’s pumping ability due to changes in the heart muscle. The heart is then too weak to pump enough blood around the body. (KOR-uh-ner-ee) The most common form of heart disease caused by atherosclerosis, the stiffening and narrowing of arteries caused, in part, by fatty plaques that build up along blood vessel walls in the coronaries (the arteries that supply the heart muscle with blood). Coronary heart disease can starve the heart of oxygen. (kree-AT-ih-nin) A waste product from protein in the diet and from the muscles of the body. Creatinine is removed from the body by the kidneys. As kidney disease progresses, the level of creatinine in the blood increases. (feh-NAH-meh-nun) The early-morning (4 a.m. to 8 a.m.) rise in blood glucose level that may stay higher later into the morning. (dee-hy-DRAY-shun) The loss of too much body fluid compared to the amount of fluid you’re taking in. This lack of fluid keeps your body from working properly and can be caused from frequent urinating, sweating, diarrhea, or vomiting. (dee-sens-ih-tiz-A-shun) Reducing response such as an allergic reaction to something. For example, if someone has diabetes and has frequent low blood glucose (blood sugar) levels (hypoglycemia) the body may not react with the same symptoms that would signal that there’s a problem. (DCCT) A study by the National Institute of Diabetes and Digestive and Kidney Diseases, conducted from 1983 to 1993 in people with type 1 diabetes. The study showed that intensive therapy compared to conventional therapy significantly helped prevent or delay diabetes complications. Intensive therapy included multiple daily insulin injections or the use of an insulin pump with multiple blood glucose (blood sugar) readings each day. Complications followed in the study included diabetic retinopathy, neuropathy, and nephropathy.  A health care professional who teaches people who have diabetes how to manage their diabetes. Some diabetes educators are certified diabetes care and education specialists (CDCES)s. (in-SIP-ih-dus) A condition unrelated to type 1, type 2, or gestational diabetes that is also characterized by frequent and heavy urination, excessive thirst, and an overall feeling of weakness. (diabetes mellitus (MELL-ih-tus)) A condition where the body’s blood glucose (blood sugar) levels are higher than normal (hyperglycemia) resulting from the body's inability to use or store blood glucose for energy. In type 1 diabetes, the pancreas no longer makes insulin and blood glucose can’t enter the cells to be used for energy. In type 2 diabetes, either the pancreas does not make enough insulin or can’t use the insulin it does produce effectively. (DPP) A study by the National Institute of Diabetes and Digestive and Kidney Diseases conducted from 1998 to 2001 in people at high risk for type 2 diabetes. All study participants had impaired glucose tolerance, also called prediabetes, and were overweight. The study showed that people who lost 5 to 7 percent of their body weight through a low-fat, low-calorie diet, and moderate exercise (usually walking for 30 minutes, five days a week) reduced their risk of getting type 2 diabetes by 58 percent. Participants who received treatment with the oral diabetes drug metformin reduced their risk of getting type 2 diabetes by 31 percent. (DKA) (KEY-toe-ass-ih-DOH-sis) An emergency condition in which high blood glucose (blood sugar) levels, along with a lack of insulin, result in the breakdown of body fat for energy and an accumulation of ketones in the blood and urine. Signs of DKA are nausea and vomiting, stomach pain, fruity breath odor, and rapid breathing. Untreated DKA can lead to coma and death. A rare fibrous breast condition occurring in women, and sometimes men, with long-standing diabetes. The lumps are not malignant and can be surgically removed, although they often recur. (my-eh-LAH-puh-thee) Damage to the spinal cord found in some people with diabetes. (REH-tih-NOP-uh-thee) A type of diabetic eye disease; damage to the small blood vessels in the retina. Loss of vision may result. (DY-uh-beh-toh-JEN-ic) Causing diabetes. For example, some drugs cause blood glucose (blood sugar) levels to rise, resulting in diabetes. (DY-uh-beh-TAH-luh-jist) A doctor who specializes in treating people with diabetes. (DY-ug-NO-sis) The determination of a disease from its signs and symptoms. (dy-AL-ih-sis) The process of cleaning wastes from the blood artificially. This job is normally done by the kidneys. If the kidneys fail, the blood must be cleaned artificially with special equipment. The two major forms of dialysis are hemodialysis and peritoneal dialysis. Diabetic kidney disease can lead to the loss of kidney function and the need for dialysis. (DY-eh-TIH-shun) A health care professional who advises people about meal planning, weight control, and diabetes management. A registered dietitian nutritionist (RDN) has more training. (DY-lay-ted) A test done by an eye care specialist in which the pupil (the black center) of the eye is temporarily enlarged with eyedrops to allow the specialist to see the inside of the eye more easily. (doo-PWEE-trenz kon-TRACK-chur) A condition associated with diabetes in which the fingers and the palm of the hand thicken and shorten, causing the fingers to curve inward. (eh-DEE-muh) Swelling caused by excess fluid in the body. (EMG) (ee-LEK-troh-my-AH-gruh-fee) A test used to detect nerve function. It measures the electrical activity generated by muscles. (EN-doh-krin) A group of specialized cells that release hormones into the blood. For example, the islets in the pancreas, which secrete insulin, are endocrine glands. (EN-doh-krih-NAH-luh-jist) A doctor who specializes in treating people who have endocrine gland problems, such as diabetes. (EN-zime) Protein made by the body that brings about a chemical reaction, for example, the enzymes produced by the gut to aid digestion. (you-gly-SEEM-ee-uh) A normal level of glucose in the blood.  One of several approaches for diabetes meal planning. Foods are categorized into three groups based on their nutritional content. Lists provide the serving sizes for carbohydrates, meat and meat alternatives, and fats. These lists allow for substitution for different groups to keep the nutritional content fixed.  A check of a person's blood glucose (blood sugar) level after the person has not eaten for 8 to 12 hours (usually overnight). A fasting blood glucose test in a lab is one of the tests used to diagnose prediabetes and diabetes. It is also used to evaluate how the treatment of a person with diabetes is working using results from a blood glucose meter. One of the three main nutrients in food. Foods that provide fat are butter, margarine, salad dressing, oil, nuts, meat, poultry, fish, and some dairy products. Excess calories are also stored as body fat, providing the body with a reserve supply of energy and is used for other functions. (FROOK-tohss) A sugar that occurs naturally in fruits and honey. Fructose has four calories per gram. (GANG-green) The death of body tissue, most often caused by a lack of blood flow and infection. It can lead to amputation. (gas-tro-puh-REE-sis) A form of neuropathy that affects the stomach. Digestion of food may be incomplete or delayed, resulting in nausea, vomiting, or bloating, making the management of blood glucose (blood sugar) difficult. (GDM) (jes-TAY-shun-ul MELL-ih-tus) A type of diabetes that develops only during pregnancy and usually disappears upon delivery, but increases the risk that the mother will develop diabetes later. GDM is managed with meal planning, activity, and, in some cases, insulin. (JIN-jih-VY-tis) A condition of the gums characterized by inflammation and bleeding. (glaw-KOH-muh) An increase in fluid pressure inside the eye that may lead to loss of vision. (glo-MEHR-yoo-lur) Measure of the kidney's ability to filter and remove waste products. (GLOO-kah-gahn) A hormone produced by the alpha cells in the pancreas. It raises blood glucose (blood sugar). An injectable and nasal forms of glucagon, available by prescription, is used to treat severe hypoglycemia. Chewable tablets made of pure glucose used for treating hypoglycemia. (gly-SEE-mik) A ranking of carbohydrate-containing foods, based on the food's effect on blood glucose (blood sugar) compared with a standard reference food. This value is not easily accessible for meal planning. (gly-koh-SOOR-ee-ah) The presence of glucose in the urine. , stands for high-density-lipoprotein cholesterol (kuh-LESS-tuh-rawl LIP-oh-PRO-teen) A fat found in the blood that takes extra cholesterol from the blood to the liver for removal. Sometimes called \"good\" cholesterol.  Some people with type 1 diabetes experience a brief remission called the \"honeymoon period.\" During this time their pancreas may still secrete some insulin. Over time, this secretion stops and as this happens, the person will require more insulin from injections. The honeymoon period can last weeks, months, or longer.  A chemical produced in one part of the body and released into the blood to trigger or regulate particular functions of the body. (HY-per-gly-SEE-mee-uh) High blood glucose (blood sugar). (HY-per-IN-suh-lih-NEE-mee-uh) A condition in which the level of insulin in the blood is higher than normal. Caused by overproduction of insulin by the body and is commonly found in people with insulin resistance. (HY-per-li-pih-DEE-mee-uh) Higher than normal fat and cholesterol levels in the blood. (HHNS) (HY-per-oz-MOH-lur HY-per-gly-SEE-mik non-kee-TAH-tik) An emergency condition in which one's blood glucose (blood sugar) level is very high and ketones are not present in the blood or urine. If HHNS is not treated, it can lead to coma or death. (HY-per-TEN-shun) A condition present when blood flows through the blood vessels with a force greater than normal. Also called high blood pressure. Hypertension can strain the heart, damage blood vessels, and increase the risk of heart attack, stroke, kidney problems, and death. (hy-po-gly-SEE-mee-uh) Low blood glucose (blood sugar) is a condition that occurs when one's blood glucose is lower than their target, usually less than 70 mg/dL. Signs include hunger, nervousness, shakiness, perspiration, dizziness or light-headedness, sleepiness, and confusion. If left untreated, hypoglycemia may lead to unconsciousness. Hypoglycemia is treated by consuming a carbohydrate-rich food such as a glucose tablet or juice. Severe low blood glucose may also be treated with an injection of glucagon if the person is unconscious or unable to swallow. Sometimes called an insulin reaction. (un-uh-WARE-ness) A state in which a person does not feel or recognize the symptoms of hypoglycemia. People who have frequent episodes of hypoglycemia may no longer experience the warning signs of it. (ih-MYOON) The body's system for protecting itself from viruses and bacteria or any \"foreign\" substances. (ih-MYOON-oh-suh-PRESS-unt) A drug that suppresses the natural immune responses. Immunosuppressants are given to transplant patients to prevent organ rejection or to patients with autoimmune diseases. (IFG) A previous term for prediabetes found when using a fasting plasma glucose test. (IGT) A previous term for prediabetes found when using an oral glucose tolerance test (OGTT). (im-PLAN-tuh-bull) A small pump placed inside the body to deliver insulin in response to remote-control commands from the user. (IM-po-tents) A type of erectile (ee-REK-tile) dysfunction (dis-FUNK-shun) when an erection cannot be achieved or maintained for sexual activity. (IN-sih-dints) A measure of how often a disease occurs; the number of new cases of a disease among a certain group of people for a certain period of time. (in-KON-tih-nents) Loss of bladder or bowel control; the accidental loss of urine or feces.  An insulin in powder form that can be inhaled to manage blood glucose. (in-JEK-shun) Inserting liquid medication or nutrients into the body with a syringe. A person with diabetes may use short needles or pinch the skin and inject at an angle to avoid an intramuscular injection of insulin.  Changing the places on the body where insulin is injected. Rotation prevents the formation of lipodystrophies. Places on the body where insulin is usually injected.  A hormone that helps the body use glucose for energy. When needed, it is taken to manage blood glucose (blood sugar). A change in the amount of insulin a person with diabetes takes based on factors such as meal planning, activity, and blood glucose (blood sugar) levels.  An insulin analogue is a tailored form of insulin in which certain amino acids in the insulin molecule have been modified. The analogue acts in the same way as the original insulin, but with some beneficial differences for people with diabetes. Analogues are sometimes referred to as \"designer\" insulins.  A device for injecting insulin that holds replaceable cartridges of insulin. Also available in disposable form.  An insulin-delivering device about the size of a deck of cards that can be worn on a belt or kept in a pocket. An insulin pump connects to narrow, flexible plastic tubing that ends with a needle inserted just under the skin. Users set the pump to give a steady trickle or basal amount of insulin continuously throughout the day. Pumps can also release bolus doses of insulin (several units at a time) at meals and at times when blood glucose (blood sugar) is too high.  When the level of glucose in the blood is too low (at or below 70 mg/dL). Also known as hypoglycemia. Areas on the outer part of a cell that allow the cell to bind with insulin in the blood. When the cell and insulin bind, the cell can take glucose from the blood and use it for energy. The body's inability to respond to and use the insulin it produces. Insulin resistance may be linked to obesity, hypertension, and high levels of fat in the blood. (IDDM) Former term for type 1 diabetes. (IN-suh-lih-NOH-mah) A tumor of the beta cells in the pancreas. An insulinoma may cause the body to make extra insulin, leading to hypoglycemia.  A treatment for diabetes in which blood glucose (blood sugar) is kept as close to normal as possible. Intramuscular injection (in-trah-MUS-kyoo-lar) inserting liquid medication into a muscle with a syringe. Glucagon may be given as an intramuscular injection for hypoglycemia. (ICAs) (EYE-let aw-toe-AN-ti-bod-eez) Proteins found in the blood of people newly diagnosed with type 1 diabetes. They are also found in people who may be developing type 1 diabetes. The presence of ICAs indicates that the body's immune system has been damaging beta cells in the pancreas. Moving the islet cells from a donor pancreas into a person whose pancreas has stopped producing insulin. Beta cells in the islets of Langerhans make the insulin that the body needs for using blood glucose (blood sugar). (LANG-er-hahns). Groups of cells located in the pancreas that make hormones that help the body break down and use food. For example, alpha cells make glucagon and beta cells make insulin. Also called islets.  Former term for type 1 diabetes.  A chemical produced when there is a shortage of insulin in the blood and the body breaks down body fat for energy. High levels of ketones can lead to diabetic ketoacidosis (DKA). Sometimes referred to as ketone bodies. (key-toe-NUH-ree-ah) A condition occurring when ketones are present in the urine, a warning sign of diabetic ketoacidosis (DKA). (ke-TOE-sis) A ketone buildup in the body that may lead to diabetic ketoacidosis (DKA). Signs of ketosis are nausea, vomiting, and stomach pain.  A chronic condition in which the body retains fluid and harmful wastes build up because the kidneys no longer work properly. A person with kidney failure needs dialysis or a kidney transplant. Also called end-stage renal (REE-nul) disease or ESRD.  The two organs that filter wastes from the blood to be removed in urine. The kidneys are located near the middle of the back. They send urine to the bladder. (KOOS-mall) The rapid, deep, and labored breathing of people who have diabetic ketoacidosis. A spring-loaded device used to prick the skin with a small needle to obtain a drop of blood for blood glucose monitoring. A type of therapy that uses a strong beam of light to treat a damaged area. The beam of light is called a laser. A laser is sometimes used to seal blood vessels in the eye of a person with diabetes. See photocoagulation. (LADA) A condition in which type 1 diabetes develops in adults. , stands for low-density lipoprotein cholesterol (kuh-LESS-tuh-rawl LIP-oh-PRO-teen) A fat found in the blood that takes cholesterol around the body to where it is needed for cell repair and also deposits it on the inside of artery walls. Sometimes called \"bad\" cholesterol. A condition in which the joints swell and the skin of the hand becomes thick, tight, and waxy, making the joints less able to move. It may affect the fingers and arms, as well as other joints in the body. (LIP-id) A term for fat in the body. Lipids can be broken down by the body and used for energy. A blood test that measures total cholesterol, triglycerides, and HDL cholesterol. LDL cholesterol is then calculated from the results. A lipid profile is one measure of a person's risk of cardiovascular disease. (LIP-oh-AT-ruh-fee) Loss of fat under the skin resulting in small dents. Lipoatrophy may be caused by repeated injections of insulin in the same spot. (LIP-oh-DIH-struh-fee) Caused by the breaking down or building up of fat below the surface of the skin, resulting in lumps or small dents in the skin surface. (See lipohypertrophy or lipoatrophy.) Lipodystrophy may be caused by repeated injections of insulin in the same spot. (LIP-oh-hy-PER-truh-fee) Buildup of fat below the surface of the skin, causing lumps. Lipohypertrophy may be caused by repeated injections of insulin in the same spot. An organ in the body that changes food into energy, removes alcohol and poisons from the blood, and makes bile, a substance that breaks down fats and helps rid the body of wastes. (mack-roh-SOH-mee-ah) Abnormally large; in diabetes, the term is used to refer to abnormally large babies that may be born to women with diabetes. (mack-roh-VASK-yoo-ler) Disease of the large blood vessels, such as those found in the heart. Lipids and blood clots build up in the large blood vessels and can cause atherosclerosis, coronary heart disease, and peripheral vascular disease. (MACK-yoo-la) The part of the retina in the eye used for reading and seeing fine detail. (MACK-yoo-lur eh-DEE-mah) Swelling of the macula. (MODY) A kind of type 2 diabetes that occurs in younger people. Is used to describe the tendency of several conditions to occur together, including obesity, insulin resistance, diabetes or prediabetes, hypertension, and high lipids. The term for the way cells chemically change food so that it can be used to store or use energy and make the proteins, fats, and sugars needed by the body. (MILL-ih-grams) (DESS-ih-lee-tur) A unit of measure that shows the concentration of a substance in a specific amount of fluid. In the United States, blood glucose (blood sugar) results are reported as mg/dL. Other countries use millimoles per liter (mmol/L). To convert to mg/dL from mmol/L, multiply mmol/L by 18. Example: 10 mmol/L × 18 = 180 mg/dL. (MY-kro-al-BYOO-min) Small amounts of the protein called albumin in the urine detectable with a special lab test. (MY-kro-al-BYOO-min-your-EE-ah) The presence of small amounts of albumin, a protein, in the urine. Microalbuminuria is an early sign of kidney damage, or nephropathy, a common and serious complication of diabetes. Microalbuminuria is usually managed through blood glucose (blood sugar) management, reducing blood pressure, and a healthy eating plan. (MY-kro-AN-yeh-rizm) A small swelling that forms on the side of tiny blood vessels. These small swellings may break and allow blood to leak into nearby tissue. People with diabetes may get microaneurysms in the retina of the eye. (MY-kro-VASK-yoo-ler) Disease of the smallest blood vessels, such as those found in the eyes, nerves, and kidneys. The walls of the vessels become abnormally thick but weak. The weakness of the walls causes them to crack and bleed, causing complications. A combination of two types of insulin in one injection. Millimoles per liter, a unit of measure that shows the concentration of a substance in a specific amount of fluid. In other countries, blood glucose (blood sugar) results are reported as mmol/L. In the United States, milligrams per deciliter (mg/dL) is used. To convert to mmol/L from mg/dL, divide mg/dL by 18. Example: 180 mg/dL × 18 = 10 mmol/L. A short piece of nylon, like a hairbrush bristle used to check the sensitivity of the nerves in the foot. (MAH-noh-ne-ROP-uh-thee) Neuropathy affecting a single nerve. (my-oh-KAR-dee-ul in-FARK-shun)—heart attack An interruption in the blood supply to the heart because of narrowed or blocked blood vessels. (NEK-roh-by-OH-sis lih-POY-dik-ah DY-uh-bet-ih-KOR-um) A skin condition usually on the lower part of the legs. Lesions can be small or extend over a large area. They are usually raised, yellow, and waxy in appearance and often have a purple border. (NEE-oh-VASK-yoo-ler-ih-ZAY-shun) The growth of new, small blood vessels. In the retina, this may lead to loss of vision or blindness. (neh-FRAH-luh-jist) A doctor who treats people who have kidney problems. (neh-FROP-uh-thee) Disease of the kidneys. Hyperglycemia and hypertension can damage the kidneys' glomeruli. When the kidneys are damaged, protein leaks out of the kidneys into the urine. Damaged kidneys can no longer remove waste and extra fluids from the bloodstream. Tests used to measure for nerve damage; one way to diagnose neuropathy. (ne-RAH-luh-jist) A doctor who specializes in problems of the nervous system, such as neuropathy. (ne-ROP-uh-thee)—diabetic nerve disease Disease of the nervous system. The three major forms in people with diabetes are peripheral neuropathy, autonomic neuropathy, and mononeuropathy. The most common form is peripheral neuropathy, which affects mainly the legs and feet. (NIDDM) Former term for type 2 diabetes. (NON-in-VAY-siv) Measuring blood glucose (blood sugar) without pricking the finger to obtain a blood sample. An intermediate-acting insulin. NPH stands for neutral protamine Hagedorn. On average, NPH insulin starts to lower blood glucose within one to two hours after injection. It has its strongest effect 6 to 10 hours after injection but keeps working about 10 hours after injection. Also called N insulin. (noo-TRIH-shuh-nist) A person with training in nutrition; may or may not have specialized training and qualifications. See dietitian. A condition in which a greater than normal amount of fat is in the body; more severe than overweight; having a body mass index of 30 or more. (ob-steh-TRIH-shun) A doctor who treats pregnant women and delivers babies. (AHF-thal-MAH-luh-jist) A medical doctor who diagnoses and treats all eye diseases and eye disorders. Ophthalmologists can also prescribe glasses and contact lenses. (ahp-TI-shun) A health care professional who dispenses glasses and lenses. An optician also makes and fits contact lenses. (ahp-TAH-meh-trist) A primary eye care provider who prescribes glasses and contact lenses. Optometrists can diagnose and treat certain eye conditions and diseases. (OGTT) A test to diagnose prediabetes and diabetes. The oral glucose tolerance test is given by a health care professional after an overnight fast. A blood sample is taken, then the patient drinks a high-glucose beverage. Blood samples are taken at intervals for two to three hours. Test results are compared with a standard and show how the body uses glucose over time. (hy-po-gly-SEE-mik) Medicines taken by mouth by people with type 2 diabetes to manage blood glucose (blood sugar) levels. An above-normal body weight; typically having a body mass index of 25 to 29.9. (PAN-kree-us) An organ that makes insulin and enzymes for digestion. The pancreas is located behind the lower part of the stomach and is about the size of a hand. A surgical procedure to take a healthy whole or partial pancreas from a donor and place it into a person with diabetes. (pee-dee-AT-rik en-doh-krih-NAH-luh-jist) A doctor who treats children who have endocrine gland problems such as diabetes. (ped-OR-thist) A health care professional who specializes in fitting shoes for people with disabilities or deformities. A pedorthist can custom-make shoes or orthotics (special inserts for shoes). (PER-ee-oh-DON-tul) Disease of the gums. (PER-ee-oh-DON-tist) A dentist who specializes in treating people who have gum diseases. (puh-RIF-uh-rul ne-ROP-uh-thee) Nerve damage that affects the feet, legs, or hands. Peripheral neuropathy causes pain, numbness, or a tingling feeling. (PAD) (puh-RIF-uh-rul VAS-kyoo-ler) A disease of the large blood vessels of the arms or legs, usually your legs. PAD may occur when major blood vessels are blocked and do not receive enough blood. The signs of PAD are aching pains and slow-healing foot sores. (PVD) (puh-RIF-uh-rul VAS-kyoo-ler) (puh-RIF-uh-rul VAS-kyoo-ler) Describes problems with blocked blood vessels disrupting the flow of blood to where it’s needed. Peripheral artery disease (PAD) is a type of PVD. (FAR-mah-sist) A health care professional who prepares and distributes medicine to people. Pharmacists also give information on medicines. (FOH-toh-koh-ag-yoo-LAY-shun) A treatment for diabetic retinopathy. A strong beam of light (laser) is used to seal off bleeding blood vessels in the eye and to burn away extra blood vessels that should not have grown there. (puh-DY-uh-trist) A doctor who treats people who have foot problems. Podiatrists also help people keep their feet healthy by providing regular foot examinations and treatment. (puh-DY-uh-tree) The care and treatment of feet. (pah-lee-DIP-see-uh) Excessive thirst; may be a sign of diabetes. (pah-lee-FAY-jee-ah) Excessive hunger; may be a sign of diabetes. (pah-lee-YOOR-ee-ah) Excessive urination; may be a sign of diabetes. (post-PRAN-dee-ul) the blood glucose (blood sugar) level one to two hours after eating. A condition in which blood glucose (blood sugar) levels are higher than normal but are not high enough for a diagnosis of diabetes. People with prediabetes are at increased risk for developing type 2 diabetes and for heart disease and having a stroke. Previous names for prediabetes are impaired glucose tolerance and impaired fasting glucose. A commercially produced combination of two different types of insulin. See 50/50 insulin and 70/30 insulin. (pree-PRAN-dee-ul) Blood glucose (blood sugar) level before eating. The number of people in a given group or population who are reported to have a disease. (proh-IN-suh-lin) The substance made first in the pancreas and then broken into several pieces to become insulin. (pro-LIH-fur-ah-tiv REH-tih-NOP-uh-thee) A condition in which fragile new blood vessels grow along the retina and in the vitreous humor of the eye.  (prahs-THEE-sis) A man-made substitute for a missing body part such as an arm or a leg. (PRO-teen) 1. One of the three main nutrients in food. Foods that provide protein include meat, poultry, fish, cheese, milk, dairy products, eggs, and dried beans. 2. Proteins are also used in the body for cell structure, hormones such as insulin, and other functions. (PRO-tee-NOOR-ee-uh) The presence of protein in the urine, indicating that the kidneys are not working properly. (HY-per-gly-SEE-mee-ah) A swing to a high level of glucose in the blood after a low level. See Somogyi effect. Diabetes self-management education programs that are approved by the American Diabetes Association. (REE-nal) Having to do with the kidneys. A renal disease is a disease of the kidneys. Renal failure means the kidneys have stopped working. (THRESH-hold) The blood glucose (blood sugar) concentration at which the kidneys start to excrete glucose into the urine. (REH-ti-nuh) The light-sensitive layer of tissue that lines the back of the eye. (REH-tih-NOP-uh-thee) Eye disease that is caused by damage to the small blood vessels in the retina. Loss of vision may result. (Also known as diabetic retinopathy) Anything that raises the chances of a person developing a disease.  A type of diabetes caused by another disease or certain drugs or chemicals.  In diabetes, the ongoing process of a person managing diabetes. This includes meal planning, physical activity, and blood glucose (blood sugar) monitoring, and may also include taking diabetes medications, handling episodes of low and high blood sugar, managing diabetes when traveling, and more. The person with diabetes designs his or her own self-management treatment plan with their diabetes care team, which may include doctors, nurses, diabetes educators, dietitians, pharmacists, and others.  A container for disposal of used needles and syringes; often made of hard plastic so that needles cannot poke through.  The unintended action(s) of a drug. A set of instructions for adjusting insulin on the basis of blood glucose (blood sugar) test results, meals, or activity levels. (suh-MOH-jee) effect—called rebound hyperglycemia When the blood glucose (blood sugar) level swings high following hypoglycemia. The Somogyi effect may follow an untreated hypoglycemic episode during the night and is caused by the release of stress hormones.  Division of a prescribed daily dose of insulin into two or more injections given over the course of the day.  Another name for carbohydrate, one of the three main nutrients in food. Condition caused by damage to blood vessels in the brain; may cause loss of ability to speak or to move parts of the body. (sub-kyoo-TAY-nee-us) Putting a fluid into the tissue under the skin with a needle and syringe. A two-part sugar made of glucose and fructose. Known as table sugar or white sugar, it is found naturally in sugar cane and in beets.  A class of carbohydrates with a sweet taste, including glucose, fructose, and sucrose. Sweeteners that produce a smaller rise in blood glucose (blood sugar) than other carbohydrates. Their calorie content is about two calories per gram. Includes erythritol, hydrogenated starch hydrolysates, isomalt, lactitol, maltitol, mannitol, sorbitol, and xylitol. Also known as polyols (PAH-lee-alls.) (suh-RINJ) A device used to inject medications or other liquids into body tissues. The syringe for insulin has a hollow plastic tube with a plunger inside and a needle on the end.  A diabetes treatment approach in which medical care is provided by a team of health care professionals which may include a doctor, a dietitian, a nurse, a diabetes educator, and others. The team acts as advisers to the person with diabetes. (try-GLISS-er-ide) The storage form of fat in the body. High triglyceride levels may occur when diabetes is out of control.  A condition characterized by high blood glucose (blood sugar) levels caused by a lack of insulin. Occurs when the body's immune system attacks the insulin-producing beta cells in the pancreas and destroys them. The pancreas then produces little or no insulin. Type 1 diabetes develops most often in young people but can appear in adults. A condition characterized by high blood glucose (blood sugar) levels caused by either a lack of insulin or the body's inability to use insulin efficiently. Type 2 diabetes develops most often in middle-aged and older adults but can appear in young people. (UL-sur) A deep open sore or break in the skin. (UL-truh-LEN-tay) Long-acting insulin. On average, ultralente insulin starts to lower blood glucose (blood sugar) within four to six hours after injection. It has its strongest effect 10 to 18 hours after injection but keeps working 24 to 28 hours after injection. Also called U insulin.  The basic measure of insulin. U-100 insulin means 100 units of insulin per milliliter (mL) or cubic centimeter (cc) of solution. Most insulin made today in the United States is U-100. (UKPDS) A study in England, conducted from 1977 to 1997 in people with type 2 diabetes. The study showed that if people lowered their blood glucose (blood sugar), they lowered their risk of eye disease and kidney damage. In addition, those with type 2 diabetes and hypertension who lowered their blood pressure also reduced their risk of stroke, eye damage, and death from long-term complications. (yoo-REE-uh) A waste product found in the blood that results from the normal breakdown of protein in the liver. Urea is normally removed from the blood by the kidneys and then excreted in the urine. (yoo-REE-mee-ah) The illness associated with the buildup of urea in the blood because the kidneys are not working effectively. Symptoms include nausea, vomiting, loss of appetite, weakness, and mental confusion.  The liquid waste product filtered from the blood by the kidneys, stored in the bladder, and expelled from the body by the act of urinating. Also called urinalysis; a test of a urine sample to diagnose diseases of the urinary system and other body systems. Urine may also be checked for signs of bleeding. Some tests use a single urine sample. For others, 24-hour collection may be needed. And sometimes a sample is \"cultured\" to see exactly what type of bacteria grows. (yoo-RAH-luh-jist) A doctor who treats people who have urinary tract problems. A urologist also cares for men who have problems with their genital organs, such as impotence. (VAS-kyoo-ler) Relating to the body's blood vessels. A blood vessel that carries blood to the heart. (VLDL) A form of cholesterol in the blood; high levels may be related to cardiovascular disease. (VIH-tree-us) The clear gel that lies behind the eye's lens and in front of the retina.  Steps taken to ensure that a wound that can lead to, or is, a foot ulcer heals correctly. People with diabetes need to take special precautions so wounds do not become infected. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/devices-technology", "title": "Devices & Technology", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "Diabetes technology has come a long way.", "What Is a Smart Insulin Pen?", "High-Tech Help to Better Manage Your Diabetes", "Choosing How to Check Your Blood Glucose", "Fewer Finger Pricks with CGM", "With Insulin Pumps, It’s Your Choice", "Is a Pump Right for You?", "Connected CGM-Insulin Pumps and “Closed Loop” Systems", "We're here to help.", "All About Insulin Pens", "Who Should Use a Pump?", "What Is Time in Range?", "Medication Management", "Understanding Blood Glucose", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. Find the device that can make your life easier. From blood glucose meters and continuous glucose monitoring (CGM) to cutting-edge insulin pumps and more, devices are easier to use and less invasive. There are lots of options so that you can find what works best for you. The new generation of connected insulin delivery devices may help simplify your routine. A smart insulin pen is a reusable injector pen with an intuitive smartphone app that can help people with diabetes better manage insulin delivery. This smart system calculates and tracks doses and provides helpful reminders, alerts, and reports. They can come in the form of an add-on to your current insulin pen or a reusable form which uses prefilled cartridges instead of vials or disposable pens. Smart insulin pens are a rapidly growing market. Why? Because they are typically more affordable, easy to use, and offer many benefits and improvements for people who depend upon insulin to manage their diabetes. The biggest challenges for many insulin pen (multiple daily injection) users are: For most people, checking blood glucose (blood sugar) meter is just a part of life. That’s why getting it right matters. The two main types are blood glucose meters that use a drop of blood to check what your levels are at that moment and continuous glucose monitors (CGMs) that check your blood glucose regularly day or night—pick the one that works best for you and your lifestyle. Of these two options, there are more choices than ever, from basic designs to more advanced models that have all the bells and whistles. And fancier isn’t necessarily better. Here are some things to consider: If you have type 1 or type 2 and just want to manage your blood glucose better, continuous glucose monitoring may be right for you. CGMs report your blood glucose levels in real time (for example every five minutes throughout the day), alert you when your glucose hits a high or a low limit, and provide insight into glucose trends. CGMs work through a sensor placed on your skin. It transmits readings to a small recording device. Whether you manage your diabetes with a pump, daily injections, or oral medications, a CGM can help you manage your blood glucose. Is a CGM right for you? Many people with type 1 and type 2 can benefit from using a CGM. Those that would benefit the most are people that have trouble reaching and maintaining target blood glucose. CGMs are particularly useful if you often have lows and are unaware of when they happen (hypoglycemia unawareness). Even if you have a good handle on your diabetes management, you still may want to consider using a CGM for the convenience and the elimination of finger pricks. However, you’ll want to keep in mind that if you are managing your diabetes well without the use of a CGM, your insurance may not cover it—they might consider it a non-necessity. The important thing to know is that a pump gives you options. You can get a pump, wear it for a time, decide to stop wearing it, and restart it if you think it will fit better with your treatment—work with your insurance to match whatever works for you. Pumps are an extra piece of hardware attached to your body. They’re programmed to deliver insulin continuously (basal), or as a surge (bolus) dose close to mealtime to control the rise in blood glucose after a meal. They work by closely mimicking your body's normal release of insulin. If your doctor determines that a pump is a good option for you, it's important to check with your insurance provider before you buy anything. Most insurance providers cover pumps, but sometimes they may not be covered and pumps can be expensive. In addition to cost, some considerations to consider when it comes to getting a pump are lifestyle, commitment, and safety. Remember, using a pump doesn’t mean you no longer have to check your blood glucose. And it can take some getting used to, from setting it up and putting it in to managing it day-to-day. Make sure you’ve spoken with your diabetes care team about how to use your insulin pump correctly and how to check if it’s working properly. A newer option to consider is using a combination CGM-insulin pump. Your insulin pump will be able to integrate your glucose data from the CGM sensor and either suggest changes to insulin dosing or adjust the appropriate amount of background or basal insulin on its own. This is triggered when you run high (more insulin needed)—or when your blood sugar runs low (insulin needs to be suspended)—so you don’t have to think about it as much. Keep in mind, though, that you will still need to administer insulin for meals. With several existing and emerging options on the market, you can pick the one that works best with your lifestyle and budget. Consider insulin pens for convenient and quick doses of insulin. Whether or not to use a pump is a personal decision. Time in range (TIR) can help you manage your blood glucose. Get a handle on diabetes medication. Blood glucose can make all the difference. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "How much to inject", "Shelf-life, temperature, and storage conditions", "Shelf-life, temperature, and storage conditions", "–Some meters are made for simpler operation, whether it’s larger buttons, illuminated screens or audio capabilities.", "–Meters vary in price, and some insurers limit coverage to specific models. Start by checking with your provider to find out what they’ll cover.", "–Consider how the meter retrieves your information and whether you can download the data to a computer or mobile device to make it easier to share with your diabetes care team.", "–If you’re using a blood glucose meter and are tired of finger pricks, there’s an alternative site monitor that lets you draw blood samples from your arm, thigh, or the palm of your hand.", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/more-about-diabetes", "title": "More About Diabetes", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "Myths About Diabetes", "Genetics of Diabetes", "We're here to help.", "Nutrition", "Fitness", "Know Your Risk", "Healthy Eating Tips", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. There's a lot to know about diabetes. Check out these resources for a deeper dive into things to know about living with this disease. When it comes to diabetes, it can be hard to separate fact from fiction. But we are committed to helping you understand it (with the facts only). If you have diabetes, you may be wondering why you developed it, or if your children will develop it too. We're here to break down the genetic component of diabetes to help make sense of it all. No matter where you are in your fight, here’s where you need to be. Get the nutrition information you need to build a balanced plate that will help your diabetes management. Start slowly and build up to an activity schedule that works for you. Discover what might work for you and ways to make it fun! Find out your risk for type 2 diabetes with our 60-Second Type 2 Diabetes Risk Test. Receive your score and be matched with resources to help you on your health care journey. Feeling lost on how to eat healthy to support your diabetes management? We've got the tips to get you there. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/type-2", "title": "Understanding Type 2 Diabetes", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "What is Type 2 Diabetes?", "Symptoms of Type 2 Diabetes", "Maybe it’s a different type", "Gestational diabetes", "Symptoms of diabetes complications", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. In type 2 diabetes, your body does not use insulin properly—this is called . At first, your beta cells make extra insulin to make up for it. Over time, your pancreas can’t make enough insulin to keep your blood glucose at normal levels. Type 2 diabetes develops most often in middle-aged and older adults but is increasing in young people. Treatment for people with type 2 diabetes will include healthy eating and exercise. However, your health care provider may need to also prescribe oral and injectable medications (including insulin) to help you meet your target blood glucose levels. The following symptoms of diabetes are typical. However, some people with type 2 diabetes have symptoms so mild that they go unnoticed. Common symptoms of diabetes: Early detection and treatment of diabetes can decrease the risk of developing the . Although there are many similarities between type 1 and type 2 diabetes, the cause of each is very different. And the treatment is usually quite different, too. Some people, especially adults who are newly diagnosed with type 1 diabetes, may have symptoms similar to type 2 diabetes and this overlap between types can be confusing. Take our to find out if you are at increased risk for having type 2 diabetes. If you or someone you know is diagnosed with type 2 diabetes but isn’t responding well to the typical treatments for type 2 diabetes, it may be worth a visit to an endocrinologist to determine what type of diabetes is happening. Generally, this requires antibody tests and possibly the measurement of a C-peptide level. Women with gestational diabetes which is why it's important for at-risk women to be tested at the proper time during pregnancy. Have you already been diagnosed with diabetes but are concerned about symptoms that may be the result of complications related to diabetes? With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "Urinating often", "Feeling very thirsty", "Feeling very hungry—even though you are eating", "Extreme fatigue", "Blurry vision", "Cuts/bruises that are slow to heal", "Tingling, pain, or numbness in the hands/feet", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/warning-signs-symptoms", "title": "Warning Signs and Symptoms", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "Type 1 & 2 Symptoms", "Type 2 Diabetes Risk Test", "Diagnosing Diabetes", "Diabetes Prevention Program", "Prediabetes", "We’re here for you.", "Risk Test", "Diabetes Food Hub®", "We Fight for You", "Community Connections", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. Know the warning signs and symptoms of diabetes and diabetes complications so you can take action to improve your health The following symptoms of diabetes are typical. However, some people with diabetes have symptoms so mild that they go unnoticed. Common symptoms of diabetes: Early detection and treatment of diabetes can decrease the risk of developing the . For some, symptoms are noticeable, and for others, they’re so mild they go unnoticed. Either way, learn what to look out for to reduce your risk of complications.  Find out if you are at risk for developing type 2 diabetes with our 60-second Type 2 Diabetes Risk Test. Learn about the different ways diabetes is diagnosed.  If you are at risk for developing diabetes or have prediabetes, find a Diabetes Prevention Program near you to cut your risk in half! Having prediabetes means your blood glucose (blood sugar) levels are high, but not high enough to be diagnosed with diabetes. And just because you have prediabetes, doesn’t mean you will get diabetes. Find out if you are at risk for developing type 2 diabetes with our 60-Second Type 2 Diabetes Risk Test. Your go-to location for free diabetes-friendly recipes. Find out how we’re fighting to put an end to diabetes and how you can become a part of the solution. Get connected to local resources in your area—just provide your ZIP Code. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "Urinating often", "Feeling very thirsty", "Feeling very hungry—even though you are eating", "Extreme fatigue", "Blurry vision", "Cuts/bruises that are slow to heal", "Weight loss—even though you are eating more (type 1)", "Tingling, pain, or numbness in the hands/feet (type 2)", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]},
{"url": "https://diabetes.org/about-diabetes/diabetes-prevention", "title": "Get smart about risks and diabetes prevention.", "headings": ["Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Navigation", "Breadcrumb", "Small changes lead to big results.", "Overweight? Know the impact.", "Need reasons to quit?", "High blood pressure", "The diabetes-cancer link", "We're here to help", "Nutrition", "Fitness", "Know Your Risk", "Type 2", "Give Today and Change lives!", "Navigation", "Navigation", "Navigation"], "content": "Learn your risk for type 2 and take steps to prevent it Learn the ins and outs of diabetes and steps for better care Obesity care is as unique as you are. Discover the different treatment and prevention options. Learn what you can do to keep your child with diabetes safe at school What you need to know about gestational diabetes Make a plan to be prepared when illness strikes Sign up to receive timely information on topics to help you and your family live a healthy life Bringing ADA's evidence-based guidelines and perspective directly to you in the store so you can make informed choices. Take the 60-second test to find out your risk Find help and resources in your zip code Choose between a one-time donation or recurring monthly gifts. Reach out and get involved in programs and events near you. We make vehicle donations easy so you can help fuel our fight, hassle-free. With early detection and awareness, you can take steps to prevent or delay the onset of type 2 diabetes. Small changes to your lifestyle can help to prevent or delay diabetes, even if you’ve been diagnosed with prediabetes. Your doctor will help you create a plan and set goals that work for you. They may also refer you to a Centers for Disease Control and Prevention (CDC) recognized, evidence-based lifestyle change program. Don’t hesitate to ask for help along your journey. If you have overweight or obesity, it impacts more than your risk of developing type 2 diabetes. It leads to unhealthy cholesterol, high blood pressure, heart disease, high blood glucose and stroke. The good news? Losing just 10-15 pounds can make a big difference. Smoking reduces the amount of oxygen that reaches your organs and can cause high blood pressure, unhealthy cholesterol, heart attacks and strokes. If you have high blood pressure, you're not alone; it affects nearly one in three American adults. You may need medication to get it under control. Researchers are exploring the link between type 2 diabetes and certain cancers. The two share some risk factors, such as age, gender and ethnicity, and lifestyle factors. When you’re managing diabetes and prediabetes, your eating plan is a powerful tool. Regular exercise can help put you back in control of your life. If you're at risk of developing type 2 diabetes, there's no better time to turn things around. Your type 2 journey is unique and it starts fresh every day. With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. 2451 Crystal Drive, Suite 900 Arlington, VA 22202 P.O. Box 7023 Merrifield, VA 22116-7023 Monday to Friday 9:00 AM–5:30 PM ET Copyright 1995–2025. American Diabetes Association®. All rights reserved.", "bullet_points": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]}
]